Catalogs/бит_ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноРедактироватьТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ВидыКонтактнойИнформации/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедуры формы на клиенте.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьДоступностьПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПроверитьДоступностьПолей();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ПолучитьМожноРедактироватьТолькоВДиалогеНаСервере(ТекСтрока) Тогда
			
			Если Элемент.ТекущийЭлемент.Имя = "РедактированиеВДиалоге" Тогда
				
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) // не проверено
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.МожноРедактироватьТолькоВДиалоге = Ложь;
		
	КонецЕсли;
	
	ПроверитьДоступностьПолей();
	
	Если НоваяСтрока И Список.Отбор.ВидОбъектаКонтактнойИнформации.Использование И Элемент.ТекущиеДанные.ВидОбъектаКонтактнойИнформации.Пустая() Тогда
		
		Элемент.ТекущиеДанные.ВидОбъектаКонтактнойИнформации = Список.Отбор.ВидОбъектаКонтактнойИнформации.Значение;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ИзменитьПорядокУТекущегоЭлемента(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ИзменитьПорядокУТекущегоЭлемента(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Прочие процедуры на клиенте.

&НаКлиенте
Процедура ПроверитьДоступностьПолей()

	ТекСтр = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтр <> Неопределено Тогда
		
		Если ТекСтр.Пустая() Тогда
			
			Доступны = Истина;
			
		Иначе
			
			Доступны = Ложь;
			
		КонецЕсли;
				
	Иначе
		
		Доступны  = Истина;
		
	КонецЕсли;
	
	Элементы.ВидОбъектаКонтактнойИнформации.ТолькоПросмотр = Не Доступны;
	Элементы.Тип.ТолькоПросмотр                            = Не Доступны;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядокУТекущегоЭлемента(ПоднятьВверх)

	текСтр = Элементы.Список.ТекущиеДанные;
	
	Если текСтр = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	текЭлемент = текСтр.Ссылка;
	текПорядок = текСтр.Порядок;
	
	ИзменитьПорядокУТекущегоЭлементаНаСервере(ПоднятьВверх, текСтр.ВидОбъектаКонтактнойИнформации, текПорядок, текЭлемент);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

// Прочие процедуры на сервере.

&НаСервере
Функция ПолучитьМожноРедактироватьТолькоВДиалогеНаСервере(Ссылка)
	
	Возврат Ссылка.МожноРедактироватьТолькоВДиалоге;	
	
КонецФункции

&НаСервере
Процедура ИзменитьПорядокУТекущегоЭлементаНаСервере(ПоднятьВверх, ВидОбъектаКонтактнойИнформации, Порядок, текЭлемент)
	
	ТЗ =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка
	|ИЗ
	|	Справочник.бит_ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	И ВидыКонтактнойИнформации.Порядок " + ?(ПоднятьВверх, "<", ">") + " &Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыКонтактнойИнформации.Порядок " + ?(ПоднятьВверх, "Убыв", "Возр");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТЗ;
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Запрос.УстановитьПараметр("Порядок",                        Порядок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект1 = текЭлемент.ПолучитьОбъект();
	Объект2 = Выборка.Ссылка.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	Порядок1 = Объект1.Порядок;
	
	Объект1.Порядок = Объект2.Порядок;
	Объект2.Порядок = Порядок1;
	
	Попытка
		
	    Объект1.Записать();
	  
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Объект1);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
	КонецПопытки;
	
	Попытка
		
	    Объект2.Записать();
	  
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Объект2);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти
